#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>

```terraform
module.keycloak_test.module.custom_realms.module.bcparks-service-transformation.keycloak_realm.this: Refreshing state... [id=bcparks-service-transformation]
module.keycloak_test.module.custom_realms.module.bcparks-service-transformation.module.realm_admin_master.keycloak_openid_client.service_account: Refreshing state... [id=1bc637a7-aadc-475a-9a82-9640503ac379]
module.keycloak_test.module.custom_realms.module.bcparks-service-transformation.module.realm_admin_master.keycloak_group.group: Refreshing state... [id=67727a7d-7e9e-4e38-b009-72294b87f8ed]
module.keycloak_test.module.custom_realms.module.bcparks-service-transformation.module.realm_viewer.module.realm_viewer.keycloak_openid_client.service_account: Refreshing state... [id=03c09f53-d470-4e1d-a117-66bc23ab2338]
module.keycloak_test.module.custom_realms.module.bcparks-service-transformation.module.realm_admin.module.realm_admin.keycloak_group.group: Refreshing state... [id=a06a71d0-b878-4955-b563-e3d4e7f942a8]
module.keycloak_test.module.custom_realms.module.bcparks-service-transformation.module.realm_admin.module.realm_admin.keycloak_openid_client.service_account: Refreshing state... [id=bb8447bb-01b4-4583-aa43-68086c7c662f]
module.keycloak_dev.module.custom_realms.module.bcparks-service-transformation.keycloak_realm.this: Refreshing state... [id=bcparks-service-transformation]
module.keycloak_dev.module.custom_realms.module.kuro-new-realm.keycloak_realm.this: Refreshing state... [id=kuro-dev-test-new-realm]
module.keycloak_dev.module.custom_realms.module.bcparks-service-transformation.module.realm_viewer.module.realm_viewer.keycloak_openid_client.service_account: Refreshing state... [id=9dfb53c4-d85d-450f-a868-d91a75432aa7]
module.keycloak_dev.module.custom_realms.module.bcparks-service-transformation.module.realm_admin.module.realm_admin.keycloak_group.group: Refreshing state... [id=869066b3-22b5-4fa4-80bd-1258571a028d]
module.keycloak_dev.module.custom_realms.module.bcparks-service-transformation.module.realm_admin_master.keycloak_openid_client.service_account: Refreshing state... [id=b66d3197-704f-46c6-9aac-498eb83c3497]
module.keycloak_prod.module.custom_realms.module.bcparks-service-transformation.keycloak_realm.this: Refreshing state... [id=bcparks-service-transformation]
module.keycloak_dev.module.custom_realms.module.bcparks-service-transformation.module.realm_viewer.module.realm_viewer.keycloak_group.group: Refreshing state... [id=a4a423b9-bf19-4e74-a03f-fd74379402d7]
module.keycloak_dev.module.custom_realms.module.bcparks-service-transformation.module.realm_admin_master.keycloak_group.group: Refreshing state... [id=5747366e-8ccf-461e-a323-660f7806c4ed]
module.keycloak_dev.module.custom_realms.module.bcparks-service-transformation.module.realm_admin.module.realm_admin.keycloak_openid_client.service_account: Refreshing state... [id=ed886bac-86bd-453d-8328-bd0d19c78714]
module.keycloak_test.module.custom_realms.module.bcparks-service-transformation.module.realm_viewer.module.realm_viewer.keycloak_role.role: Refreshing state... [id=81be272f-96a6-432b-9ec3-a1c48fc74e6f]
module.keycloak_test.module.custom_realms.module.bcparks-service-transformation.module.realm_admin.module.realm_admin.keycloak_role.role: Refreshing state... [id=00e0874c-c611-4b28-ae94-39517625830c]
module.keycloak_dev.module.custom_realms.module.kuro-new-realm.module.realm_admin.module.realm_admin.keycloak_group.group: Refreshing state... [id=d7c1057d-9acd-4c04-8530-bab165299c4c]
module.keycloak_prod.module.custom_realms.module.bcparks-service-transformation.module.realm_admin_master.keycloak_openid_client.service_account: Refreshing state... [id=430f6a30-06b4-4503-8a35-7c0549bdc57c]
module.keycloak_dev.module.custom_realms.module.kuro-new-realm.module.realm_admin.module.realm_admin.keycloak_openid_client.service_account: Refreshing state... [id=feedf497-c135-4685-b849-3191f8315f1b]
module.keycloak_dev.module.custom_realms.module.kuro-new-realm.module.realm_admin_master.keycloak_openid_client.service_account: Refreshing state... [id=14620a00-9fb1-489c-831b-2e0b3853be68]
module.keycloak_dev.module.custom_realms.module.kuro-new-realm.module.realm_viewer.module.realm_viewer.keycloak_group.group: Refreshing state... [id=56a0aa7e-4e57-4759-8981-42de4e0afbee]
module.keycloak_prod.module.custom_realms.module.bcparks-service-transformation.module.realm_viewer.module.realm_viewer.keycloak_openid_client.service_account: Refreshing state... [id=b4c492dd-29ad-4eff-9f6a-6199e40d4489]
module.keycloak_prod.module.custom_realms.module.bcparks-service-transformation.module.realm_admin.module.realm_admin.keycloak_openid_client.service_account: Refreshing state... [id=41ba8e6d-87ff-41ae-a13c-42b0ccc34c80]
module.keycloak_dev.module.custom_realms.module.kuro-new-realm.module.realm_viewer.module.realm_viewer.keycloak_openid_client.service_account: Refreshing state... [id=15f1b1f7-b864-4131-96d7-44ca8ed80075]
module.keycloak_prod.module.custom_realms.module.bcparks-service-transformation.module.realm_admin_master.keycloak_group.group: Refreshing state... [id=6064bcea-1e5a-4b90-afff-15e0a6164604]
module.keycloak_dev.module.custom_realms.module.kuro-new-realm.module.realm_admin_master.keycloak_group.group: Refreshing state... [id=45ed723e-b971-484e-b80c-2171a15e72ab]
module.keycloak_test.module.custom_realms.module.bcparks-service-transformation.module.realm_admin_master.keycloak_role.role: Refreshing state... [id=9fd64b5f-8912-4aeb-bad2-c19439762f4d]
module.keycloak_test.module.custom_realms.module.bcparks-service-transformation.module.realm_admin.module.realm_admin.keycloak_group_roles.role_group_binding: Refreshing state... [id=bcparks-service-transformation/a06a71d0-b878-4955-b563-e3d4e7f942a8]
module.keycloak_test.module.custom_realms.module.bcparks-service-transformation.module.realm_admin.module.realm_admin.keycloak_openid_client_service_account_realm_role.role_service_account_binding: Refreshing state... [id=112f8ca9-91c6-4be2-ab3e-4278e8fdaf21/00e0874c-c611-4b28-ae94-39517625830c]
module.keycloak_test.module.custom_realms.module.bcparks-service-transformation.module.realm_viewer.module.realm_viewer.keycloak_openid_client_service_account_realm_role.role_service_account_binding: Refreshing state... [id=746c937d-4492-4c3e-91e3-7dc355a5a701/81be272f-96a6-432b-9ec3-a1c48fc74e6f]
module.keycloak_dev.module.custom_realms.module.bcparks-service-transformation.module.realm_admin.module.realm_admin.keycloak_role.role: Refreshing state... [id=01d9c4a4-5813-46dd-b71f-7502501c2b22]
module.keycloak_dev.module.custom_realms.module.bcparks-service-transformation.module.realm_viewer.module.realm_viewer.keycloak_role.role: Refreshing state... [id=122c16c9-bd55-4ad4-bd50-3fe049d33ed9]
module.keycloak_dev.module.custom_realms.module.bcparks-service-transformation.module.realm_admin_master.keycloak_role.role: Refreshing state... [id=92b708c6-23f9-4fe4-bc05-9308f8a944c7]
module.keycloak_test.module.custom_realms.module.bcparks-service-transformation.module.realm_admin_master.keycloak_group_roles.role_group_binding: Refreshing state... [id=master/67727a7d-7e9e-4e38-b009-72294b87f8ed]
module.keycloak_test.module.custom_realms.module.bcparks-service-transformation.module.realm_admin_master.keycloak_openid_client_service_account_realm_role.role_service_account_binding: Refreshing state... [id=4d005c17-fe3a-412a-afc3-63b3f60e39c8/9fd64b5f-8912-4aeb-bad2-c19439762f4d]
module.keycloak_dev.module.custom_realms.module.bcparks-service-transformation.module.realm_admin.module.realm_admin.keycloak_group_roles.role_group_binding: Refreshing state... [id=bcparks-service-transformation/869066b3-22b5-4fa4-80bd-1258571a028d]
module.keycloak_dev.module.custom_realms.module.bcparks-service-transformation.module.realm_admin.module.realm_admin.keycloak_openid_client_service_account_realm_role.role_service_account_binding: Refreshing state... [id=b4f70925-3cc5-4a2e-9506-389b3ab45db1/01d9c4a4-5813-46dd-b71f-7502501c2b22]
module.keycloak_dev.module.custom_realms.module.bcparks-service-transformation.module.realm_viewer.module.realm_viewer.keycloak_group_roles.role_group_binding: Refreshing state... [id=bcparks-service-transformation/a4a423b9-bf19-4e74-a03f-fd74379402d7]
module.keycloak_dev.module.custom_realms.module.bcparks-service-transformation.module.realm_viewer.module.realm_viewer.keycloak_openid_client_service_account_realm_role.role_service_account_binding: Refreshing state... [id=0f745bfb-33c1-44ae-a206-1aef4cd962b9/122c16c9-bd55-4ad4-bd50-3fe049d33ed9]
module.keycloak_dev.module.custom_realms.module.bcparks-service-transformation.module.realm_admin_master.keycloak_group_roles.role_group_binding: Refreshing state... [id=master/5747366e-8ccf-461e-a323-660f7806c4ed]
module.keycloak_dev.module.custom_realms.module.bcparks-service-transformation.module.realm_admin_master.keycloak_openid_client_service_account_realm_role.role_service_account_binding: Refreshing state... [id=6a4a0757-206a-465d-a34e-a2bb1f228cbc/92b708c6-23f9-4fe4-bc05-9308f8a944c7]
module.keycloak_dev.module.custom_realms.module.kuro-new-realm.module.realm_admin_master.keycloak_role.role: Refreshing state... [id=70477b7c-99d1-4f45-905c-ed38f3157c11]
module.keycloak_dev.module.custom_realms.module.kuro-new-realm.module.realm_admin.module.realm_admin.keycloak_role.role: Refreshing state... [id=e607c8ac-1e2d-4714-bfb9-424fbed374ea]
module.keycloak_prod.module.custom_realms.module.bcparks-service-transformation.module.realm_admin.module.realm_admin.keycloak_role.role: Refreshing state... [id=2eee1419-877d-4640-9246-2f3b7c40a790]
module.keycloak_dev.module.custom_realms.module.kuro-new-realm.module.realm_viewer.module.realm_viewer.keycloak_role.role: Refreshing state... [id=3edbf141-9dd7-4dab-8b7f-28912764e716]
module.keycloak_prod.module.custom_realms.module.bcparks-service-transformation.module.realm_viewer.module.realm_viewer.keycloak_role.role: Refreshing state... [id=bf405a0f-cd3e-4590-9a1e-4fa98b94ae2a]
module.keycloak_prod.module.custom_realms.module.bcparks-service-transformation.module.realm_admin_master.keycloak_role.role: Refreshing state... [id=5e8e3dca-1c88-4b48-abe3-48e2d341d803]
module.keycloak_prod.module.custom_realms.module.bcparks-service-transformation.module.realm_admin.module.realm_admin.keycloak_openid_client_service_account_realm_role.role_service_account_binding: Refreshing state... [id=5f634583-cd9a-4e68-a81b-8874cbdc21ff/2eee1419-877d-4640-9246-2f3b7c40a790]
module.keycloak_dev.module.custom_realms.module.kuro-new-realm.module.realm_admin.module.realm_admin.keycloak_openid_client_service_account_realm_role.role_service_account_binding: Refreshing state... [id=abfbf916-5d0a-4a4e-83e3-3d57566d1ed2/e607c8ac-1e2d-4714-bfb9-424fbed374ea]
module.keycloak_dev.module.custom_realms.module.kuro-new-realm.module.realm_admin_master.keycloak_group_roles.role_group_binding: Refreshing state... [id=master/45ed723e-b971-484e-b80c-2171a15e72ab]
module.keycloak_dev.module.custom_realms.module.kuro-new-realm.module.realm_admin_master.keycloak_openid_client_service_account_realm_role.role_service_account_binding: Refreshing state... [id=6eb3a594-d3be-4c3f-94bd-a0fef801ed9b/70477b7c-99d1-4f45-905c-ed38f3157c11]
module.keycloak_dev.module.custom_realms.module.kuro-new-realm.module.realm_admin.module.realm_admin.keycloak_group_roles.role_group_binding: Refreshing state... [id=kuro-dev-test-new-realm/d7c1057d-9acd-4c04-8530-bab165299c4c]
module.keycloak_dev.module.custom_realms.module.kuro-new-realm.module.realm_viewer.module.realm_viewer.keycloak_openid_client_service_account_realm_role.role_service_account_binding: Refreshing state... [id=b6e9d120-1d74-489d-af80-d771955b3ef5/3edbf141-9dd7-4dab-8b7f-28912764e716]
module.keycloak_dev.module.custom_realms.module.kuro-new-realm.module.realm_viewer.module.realm_viewer.keycloak_group_roles.role_group_binding: Refreshing state... [id=kuro-dev-test-new-realm/56a0aa7e-4e57-4759-8981-42de4e0afbee]
module.keycloak_prod.module.custom_realms.module.bcparks-service-transformation.module.realm_viewer.module.realm_viewer.keycloak_openid_client_service_account_realm_role.role_service_account_binding: Refreshing state... [id=b5719a55-48d6-47ae-bd28-97879d9c7f2d/bf405a0f-cd3e-4590-9a1e-4fa98b94ae2a]
module.keycloak_prod.module.custom_realms.module.bcparks-service-transformation.module.realm_admin_master.keycloak_group_roles.role_group_binding: Refreshing state... [id=master/6064bcea-1e5a-4b90-afff-15e0a6164604]
module.keycloak_prod.module.custom_realms.module.bcparks-service-transformation.module.realm_admin_master.keycloak_openid_client_service_account_realm_role.role_service_account_binding: Refreshing state... [id=947e9768-f5db-4a66-b8f6-e5691ab74c8f/5e8e3dca-1c88-4b48-abe3-48e2d341d803]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # module.keycloak_dev.module.custom_realms.module.kuro-new-realm.keycloak_realm.this has changed
  ~ resource "keycloak_realm" "this" {
      + attributes                               = {}
      + default_default_client_scopes            = []
      + default_optional_client_scopes           = []
        id                                       = "kuro-dev-test-new-realm"
        # (39 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # module.keycloak_dev.module.custom_realms.module.bcparks-service-transformation.module.realm_admin_master.keycloak_group.group has changed
  ~ resource "keycloak_group" "group" {
      + attributes = {}
        id         = "5747366e-8ccf-461e-a323-660f7806c4ed"
        name       = "bcparks-service-transformation Realm Administrator"
        # (2 unchanged attributes hidden)
    }

  # module.keycloak_dev.module.custom_realms.module.bcparks-service-transformation.module.realm_admin_master.keycloak_openid_client.service_account has changed
  ~ resource "keycloak_openid_client" "service_account" {
      + extra_config                               = {}
        id                                         = "b66d3197-704f-46c6-9aac-498eb83c3497"
        name                                       = "bcparks-service-transformation-realm-admin-cli"
      + valid_redirect_uris                        = []
      + web_origins                                = []
        # (21 unchanged attributes hidden)
    }

  # module.keycloak_dev.module.custom_realms.module.bcparks-service-transformation.module.realm_admin_master.keycloak_role.role has changed
  ~ resource "keycloak_role" "role" {
      + attributes      = {}
        id              = "92b708c6-23f9-4fe4-bc05-9308f8a944c7"
        name            = "bcparks-service-transformation-realm-admin"
        # (2 unchanged attributes hidden)
    }

  # module.keycloak_dev.module.custom_realms.module.kuro-new-realm.module.realm_admin_master.keycloak_group.group has changed
  ~ resource "keycloak_group" "group" {
      + attributes = {}
        id         = "45ed723e-b971-484e-b80c-2171a15e72ab"
        name       = "kuro-dev-test-new-realm Realm Administrator"
        # (2 unchanged attributes hidden)
    }

  # module.keycloak_dev.module.custom_realms.module.kuro-new-realm.module.realm_admin_master.keycloak_openid_client.service_account has changed
  ~ resource "keycloak_openid_client" "service_account" {
      + extra_config                               = {}
        id                                         = "14620a00-9fb1-489c-831b-2e0b3853be68"
        name                                       = "kuro-dev-test-new-realm-realm-admin-cli"
      + valid_redirect_uris                        = []
      + web_origins                                = []
        # (21 unchanged attributes hidden)
    }

  # module.keycloak_dev.module.custom_realms.module.kuro-new-realm.module.realm_admin_master.keycloak_role.role has changed
  ~ resource "keycloak_role" "role" {
      + attributes      = {}
        id              = "70477b7c-99d1-4f45-905c-ed38f3157c11"
        name            = "kuro-dev-test-new-realm-realm-admin"
        # (2 unchanged attributes hidden)
    }

  # module.keycloak_prod.module.custom_realms.module.bcparks-service-transformation.module.realm_admin_master.keycloak_group.group has changed
  ~ resource "keycloak_group" "group" {
      + attributes = {}
        id         = "6064bcea-1e5a-4b90-afff-15e0a6164604"
        name       = "bcparks-service-transformation Realm Administrator"
        # (2 unchanged attributes hidden)
    }

  # module.keycloak_prod.module.custom_realms.module.bcparks-service-transformation.module.realm_admin_master.keycloak_openid_client.service_account has changed
  ~ resource "keycloak_openid_client" "service_account" {
      + extra_config                               = {}
        id                                         = "430f6a30-06b4-4503-8a35-7c0549bdc57c"
        name                                       = "bcparks-service-transformation-realm-admin-cli"
      + valid_redirect_uris                        = []
      + web_origins                                = []
        # (21 unchanged attributes hidden)
    }

  # module.keycloak_prod.module.custom_realms.module.bcparks-service-transformation.module.realm_admin_master.keycloak_role.role has changed
  ~ resource "keycloak_role" "role" {
      + attributes      = {}
        id              = "5e8e3dca-1c88-4b48-abe3-48e2d341d803"
        name            = "bcparks-service-transformation-realm-admin"
        # (2 unchanged attributes hidden)
    }

  # module.keycloak_test.module.custom_realms.module.bcparks-service-transformation.module.realm_admin_master.keycloak_group.group has changed
  ~ resource "keycloak_group" "group" {
      + attributes = {}
        id         = "67727a7d-7e9e-4e38-b009-72294b87f8ed"
        name       = "bcparks-service-transformation Realm Administrator"
        # (2 unchanged attributes hidden)
    }

  # module.keycloak_test.module.custom_realms.module.bcparks-service-transformation.module.realm_admin_master.keycloak_openid_client.service_account has changed
  ~ resource "keycloak_openid_client" "service_account" {
      + extra_config                               = {}
        id                                         = "1bc637a7-aadc-475a-9a82-9640503ac379"
        name                                       = "bcparks-service-transformation-realm-admin-cli"
      + valid_redirect_uris                        = []
      + web_origins                                = []
        # (21 unchanged attributes hidden)
    }

  # module.keycloak_test.module.custom_realms.module.bcparks-service-transformation.module.realm_admin_master.keycloak_role.role has changed
  ~ resource "keycloak_role" "role" {
      + attributes      = {}
        id              = "9fd64b5f-8912-4aeb-bad2-c19439762f4d"
        name            = "bcparks-service-transformation-realm-admin"
        # (2 unchanged attributes hidden)
    }

  # module.keycloak_dev.module.custom_realms.module.bcparks-service-transformation.module.realm_admin.module.realm_admin.keycloak_group.group has changed
  ~ resource "keycloak_group" "group" {
      + attributes = {}
        id         = "869066b3-22b5-4fa4-80bd-1258571a028d"
        name       = "Realm Administrator"
        # (2 unchanged attributes hidden)
    }

  # module.keycloak_dev.module.custom_realms.module.bcparks-service-transformation.module.realm_admin.module.realm_admin.keycloak_openid_client.service_account has changed
  ~ resource "keycloak_openid_client" "service_account" {
      + extra_config                               = {}
        id                                         = "ed886bac-86bd-453d-8328-bd0d19c78714"
        name                                       = "realm-admin-cli"
      + valid_redirect_uris                        = []
      + web_origins                                = []
        # (21 unchanged attributes hidden)
    }

  # module.keycloak_dev.module.custom_realms.module.bcparks-service-transformation.module.realm_admin.module.realm_admin.keycloak_role.role has changed
  ~ resource "keycloak_role" "role" {
      + attributes      = {}
        id              = "01d9c4a4-5813-46dd-b71f-7502501c2b22"
        name            = "realm-admin"
        # (2 unchanged attributes hidden)
    }

  # module.keycloak_dev.module.custom_realms.module.bcparks-service-transformation.module.realm_viewer.module.realm_viewer.keycloak_group.group has changed
  ~ resource "keycloak_group" "group" {
      + attributes = {}
        id         = "a4a423b9-bf19-4e74-a03f-fd74379402d7"
        name       = "Realm Viewer"
        # (2 unchanged attributes hidden)
    }

  # module.keycloak_dev.module.custom_realms.module.bcparks-service-transformation.module.realm_viewer.module.realm_viewer.keycloak_openid_client.service_account has changed
  ~ resource "keycloak_openid_client" "service_account" {
      + extra_config                               = {}
        id                                         = "9dfb53c4-d85d-450f-a868-d91a75432aa7"
        name                                       = "realm-viewer-cli"
      + valid_redirect_uris                        = []
      + web_origins                                = []
        # (21 unchanged attributes hidden)
    }

  # module.keycloak_dev.module.custom_realms.module.bcparks-service-transformation.module.realm_viewer.module.realm_viewer.keycloak_role.role has changed
  ~ resource "keycloak_role" "role" {
      + attributes      = {}
        id              = "122c16c9-bd55-4ad4-bd50-3fe049d33ed9"
        name            = "realm-viewer"
        # (2 unchanged attributes hidden)
    }

  # module.keycloak_dev.module.custom_realms.module.kuro-new-realm.module.realm_admin.module.realm_admin.keycloak_group.group has changed
  ~ resource "keycloak_group" "group" {
      + attributes = {}
        id         = "d7c1057d-9acd-4c04-8530-bab165299c4c"
        name       = "Realm Administrator"
        # (2 unchanged attributes hidden)
    }

  # module.keycloak_dev.module.custom_realms.module.kuro-new-realm.module.realm_admin.module.realm_admin.keycloak_openid_client.service_account has changed
  ~ resource "keycloak_openid_client" "service_account" {
      + extra_config                               = {}
        id                                         = "feedf497-c135-4685-b849-3191f8315f1b"
        name                                       = "realm-admin-cli"
      + valid_redirect_uris                        = []
      + web_origins                                = []
        # (21 unchanged attributes hidden)
    }

  # module.keycloak_dev.module.custom_realms.module.kuro-new-realm.module.realm_admin.module.realm_admin.keycloak_role.role has changed
  ~ resource "keycloak_role" "role" {
      + attributes      = {}
        id              = "e607c8ac-1e2d-4714-bfb9-424fbed374ea"
        name            = "realm-admin"
        # (2 unchanged attributes hidden)
    }

  # module.keycloak_dev.module.custom_realms.module.kuro-new-realm.module.realm_viewer.module.realm_viewer.keycloak_group.group has changed
  ~ resource "keycloak_group" "group" {
      + attributes = {}
        id         = "56a0aa7e-4e57-4759-8981-42de4e0afbee"
        name       = "Realm Viewer"
        # (2 unchanged attributes hidden)
    }

  # module.keycloak_dev.module.custom_realms.module.kuro-new-realm.module.realm_viewer.module.realm_viewer.keycloak_openid_client.service_account has changed
  ~ resource "keycloak_openid_client" "service_account" {
      + extra_config                               = {}
        id                                         = "15f1b1f7-b864-4131-96d7-44ca8ed80075"
        name                                       = "realm-viewer-cli"
      + valid_redirect_uris                        = []
      + web_origins                                = []
        # (21 unchanged attributes hidden)
    }

  # module.keycloak_dev.module.custom_realms.module.kuro-new-realm.module.realm_viewer.module.realm_viewer.keycloak_role.role has changed
  ~ resource "keycloak_role" "role" {
      + attributes      = {}
        id              = "3edbf141-9dd7-4dab-8b7f-28912764e716"
        name            = "realm-viewer"
        # (2 unchanged attributes hidden)
    }

  # module.keycloak_prod.module.custom_realms.module.bcparks-service-transformation.module.realm_admin.module.realm_admin.keycloak_openid_client.service_account has changed
  ~ resource "keycloak_openid_client" "service_account" {
      + extra_config                               = {}
        id                                         = "41ba8e6d-87ff-41ae-a13c-42b0ccc34c80"
        name                                       = "realm-admin-cli"
      + valid_redirect_uris                        = []
      + web_origins                                = []
        # (21 unchanged attributes hidden)
    }

  # module.keycloak_prod.module.custom_realms.module.bcparks-service-transformation.module.realm_admin.module.realm_admin.keycloak_role.role has changed
  ~ resource "keycloak_role" "role" {
      + attributes      = {}
        id              = "2eee1419-877d-4640-9246-2f3b7c40a790"
        name            = "realm-admin"
        # (2 unchanged attributes hidden)
    }

  # module.keycloak_prod.module.custom_realms.module.bcparks-service-transformation.module.realm_viewer.module.realm_viewer.keycloak_openid_client.service_account has changed
  ~ resource "keycloak_openid_client" "service_account" {
      + extra_config                               = {}
        id                                         = "b4c492dd-29ad-4eff-9f6a-6199e40d4489"
        name                                       = "realm-viewer-cli"
      + valid_redirect_uris                        = []
      + web_origins                                = []
        # (21 unchanged attributes hidden)
    }

  # module.keycloak_prod.module.custom_realms.module.bcparks-service-transformation.module.realm_viewer.module.realm_viewer.keycloak_role.role has changed
  ~ resource "keycloak_role" "role" {
      + attributes      = {}
        id              = "bf405a0f-cd3e-4590-9a1e-4fa98b94ae2a"
        name            = "realm-viewer"
        # (2 unchanged attributes hidden)
    }

  # module.keycloak_test.module.custom_realms.module.bcparks-service-transformation.module.realm_admin.module.realm_admin.keycloak_group.group has changed
  ~ resource "keycloak_group" "group" {
      + attributes = {}
        id         = "a06a71d0-b878-4955-b563-e3d4e7f942a8"
        name       = "Realm Administrator"
        # (2 unchanged attributes hidden)
    }

  # module.keycloak_test.module.custom_realms.module.bcparks-service-transformation.module.realm_admin.module.realm_admin.keycloak_openid_client.service_account has changed
  ~ resource "keycloak_openid_client" "service_account" {
      + extra_config                               = {}
        id                                         = "bb8447bb-01b4-4583-aa43-68086c7c662f"
        name                                       = "realm-admin-cli"
      + valid_redirect_uris                        = []
      + web_origins                                = []
        # (21 unchanged attributes hidden)
    }

  # module.keycloak_test.module.custom_realms.module.bcparks-service-transformation.module.realm_admin.module.realm_admin.keycloak_role.role has changed
  ~ resource "keycloak_role" "role" {
      + attributes      = {}
        id              = "00e0874c-c611-4b28-ae94-39517625830c"
        name            = "realm-admin"
        # (2 unchanged attributes hidden)
    }

  # module.keycloak_test.module.custom_realms.module.bcparks-service-transformation.module.realm_viewer.module.realm_viewer.keycloak_openid_client.service_account has changed
  ~ resource "keycloak_openid_client" "service_account" {
      + extra_config                               = {}
        id                                         = "03c09f53-d470-4e1d-a117-66bc23ab2338"
        name                                       = "realm-viewer-cli"
      + valid_redirect_uris                        = []
      + web_origins                                = []
        # (21 unchanged attributes hidden)
    }

  # module.keycloak_test.module.custom_realms.module.bcparks-service-transformation.module.realm_viewer.module.realm_viewer.keycloak_role.role has changed
  ~ resource "keycloak_role" "role" {
      + attributes      = {}
        id              = "81be272f-96a6-432b-9ec3-a1c48fc74e6f"
        name            = "realm-viewer"
        # (2 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # module.keycloak_dev.module.master_viewer_role.keycloak_openid_client.viewer_service_account will be created
  + resource "keycloak_openid_client" "viewer_service_account" {
      + access_type                               = "CONFIDENTIAL"
      + backchannel_logout_session_required       = true
      + client_authenticator_type                 = "client-secret"
      + client_id                                 = "viewer-custom-realms-cli"
      + client_secret                             = (sensitive value)
      + consent_required                          = false
      + direct_access_grants_enabled              = false
      + display_on_consent_screen                 = false
      + enabled                                   = true
      + exclude_session_state_from_auth_response  = false
      + frontchannel_logout_enabled               = false
      + full_scope_allowed                        = true
      + id                                        = (known after apply)
      + implicit_flow_enabled                     = false
      + name                                      = "viewer-custom-realms-cli"
      + oauth2_device_authorization_grant_enabled = false
      + realm_id                                  = "master"
      + resource_server_id                        = (known after apply)
      + service_account_user_id                   = (known after apply)
      + service_accounts_enabled                  = true
      + standard_flow_enabled                     = false
      + use_refresh_tokens                        = true
      + use_refresh_tokens_client_credentials     = false
    }

  # module.keycloak_dev.module.master_viewer_role.keycloak_openid_client_service_account_realm_role.viewer_service_account_viewer_role will be created
  + resource "keycloak_openid_client_service_account_realm_role" "viewer_service_account_viewer_role" {
      + id                      = (known after apply)
      + realm_id                = "master"
      + role                    = "viewer-custom-realms"
      + service_account_user_id = (known after apply)
    }

  # module.keycloak_dev.module.master_viewer_role.keycloak_role.viewer will be created
  + resource "keycloak_role" "viewer" {
      + composite_roles = [
          + "05a865c2-0baf-434b-8bb5-26da5f719eb8",
          + "4345faf0-5194-42ea-88da-17109ea0cc6a",
          + "57a258b2-41cb-4b89-8ed9-21f6fbdcfb1e",
          + "632d8767-da11-4146-8fd2-58d38d451415",
          + "94073b58-9c32-409d-a440-0ded7d3a56de",
          + "f82c59e9-b28c-4062-9153-11389ee110d7",
        ]
      + id              = (known after apply)
      + name            = "viewer-custom-realms"
      + realm_id        = "master"
    }

  # module.keycloak_prod.module.master_viewer_role.data.keycloak_openid_client.clients["bcparks-service-transformation"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_openid_client" "clients"  {
      + access_token_lifespan                      = (known after apply)
      + access_type                                = (known after apply)
      + admin_url                                  = (known after apply)
      + authentication_flow_binding_overrides      = (known after apply)
      + authorization                              = (known after apply)
      + backchannel_logout_revoke_offline_sessions = (known after apply)
      + backchannel_logout_session_required        = (known after apply)
      + backchannel_logout_url                     = (known after apply)
      + base_url                                   = (known after apply)
      + client_authenticator_type                  = (known after apply)
      + client_id                                  = "bcparks-service-transformation-realm"
      + client_offline_session_idle_timeout        = (known after apply)
      + client_offline_session_max_lifespan        = (known after apply)
      + client_secret                              = (sensitive value)
      + client_session_idle_timeout                = (known after apply)
      + client_session_max_lifespan                = (known after apply)
      + consent_required                           = (known after apply)
      + description                                = (known after apply)
      + direct_access_grants_enabled               = (known after apply)
      + enabled                                    = (known after apply)
      + exclude_session_state_from_auth_response   = (known after apply)
      + extra_config                               = (known after apply)
      + frontchannel_logout_enabled                = (known after apply)
      + frontchannel_logout_url                    = (known after apply)
      + full_scope_allowed                         = (known after apply)
      + id                                         = (known after apply)
      + implicit_flow_enabled                      = (known after apply)
      + login_theme                                = (known after apply)
      + name                                       = (known after apply)
      + pkce_code_challenge_method                 = (known after apply)
      + realm_id                                   = "master"
      + resource_server_id                         = (known after apply)
      + root_url                                   = (known after apply)
      + service_account_user_id                    = (known after apply)
      + service_accounts_enabled                   = (known after apply)
      + standard_flow_enabled                      = (known after apply)
      + use_refresh_tokens                         = (known after apply)
      + use_refresh_tokens_client_credentials      = (known after apply)
      + valid_redirect_uris                        = (known after apply)
      + web_origins                                = (known after apply)
    }

  # module.keycloak_prod.module.master_viewer_role.data.keycloak_role.view_authorization["bcparks-service-transformation"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "view_authorization"  {
      + attributes      = (known after apply)
      + client_id       = (known after apply)
      + composite_roles = (known after apply)
      + description     = (known after apply)
      + id              = (known after apply)
      + name            = "view-authorization"
      + realm_id        = "master"
    }

  # module.keycloak_prod.module.master_viewer_role.data.keycloak_role.view_clients["bcparks-service-transformation"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "view_clients"  {
      + attributes      = (known after apply)
      + client_id       = (known after apply)
      + composite_roles = (known after apply)
      + description     = (known after apply)
      + id              = (known after apply)
      + name            = "view-clients"
      + realm_id        = "master"
    }

  # module.keycloak_prod.module.master_viewer_role.data.keycloak_role.view_events["bcparks-service-transformation"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "view_events"  {
      + attributes      = (known after apply)
      + client_id       = (known after apply)
      + composite_roles = (known after apply)
      + description     = (known after apply)
      + id              = (known after apply)
      + name            = "view-events"
      + realm_id        = "master"
    }

  # module.keycloak_prod.module.master_viewer_role.data.keycloak_role.view_identity_providers["bcparks-service-transformation"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "view_identity_providers"  {
      + attributes      = (known after apply)
      + client_id       = (known after apply)
      + composite_roles = (known after apply)
      + description     = (known after apply)
      + id              = (known after apply)
      + name            = "view-identity-providers"
      + realm_id        = "master"
    }

  # module.keycloak_prod.module.master_viewer_role.data.keycloak_role.view_realm["bcparks-service-transformation"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "view_realm"  {
      + attributes      = (known after apply)
      + client_id       = (known after apply)
      + composite_roles = (known after apply)
      + description     = (known after apply)
      + id              = (known after apply)
      + name            = "view-realm"
      + realm_id        = "master"
    }

  # module.keycloak_prod.module.master_viewer_role.data.keycloak_role.view_users["bcparks-service-transformation"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "view_users"  {
      + attributes      = (known after apply)
      + client_id       = (known after apply)
      + composite_roles = (known after apply)
      + description     = (known after apply)
      + id              = (known after apply)
      + name            = "view-users"
      + realm_id        = "master"
    }

  # module.keycloak_prod.module.master_viewer_role.keycloak_openid_client.viewer_service_account will be created
  + resource "keycloak_openid_client" "viewer_service_account" {
      + access_type                               = "CONFIDENTIAL"
      + backchannel_logout_session_required       = true
      + client_authenticator_type                 = "client-secret"
      + client_id                                 = "viewer-custom-realms-cli"
      + client_secret                             = (sensitive value)
      + consent_required                          = false
      + direct_access_grants_enabled              = false
      + display_on_consent_screen                 = false
      + enabled                                   = true
      + exclude_session_state_from_auth_response  = false
      + frontchannel_logout_enabled               = false
      + full_scope_allowed                        = true
      + id                                        = (known after apply)
      + implicit_flow_enabled                     = false
      + name                                      = "viewer-custom-realms-cli"
      + oauth2_device_authorization_grant_enabled = false
      + realm_id                                  = "master"
      + resource_server_id                        = (known after apply)
      + service_account_user_id                   = (known after apply)
      + service_accounts_enabled                  = true
      + standard_flow_enabled                     = false
      + use_refresh_tokens                        = true
      + use_refresh_tokens_client_credentials     = false
    }

  # module.keycloak_prod.module.master_viewer_role.keycloak_openid_client_service_account_realm_role.viewer_service_account_viewer_role will be created
  + resource "keycloak_openid_client_service_account_realm_role" "viewer_service_account_viewer_role" {
      + id                      = (known after apply)
      + realm_id                = "master"
      + role                    = "viewer-custom-realms"
      + service_account_user_id = (known after apply)
    }

  # module.keycloak_prod.module.master_viewer_role.keycloak_role.viewer will be created
  + resource "keycloak_role" "viewer" {
      + composite_roles = (known after apply)
      + id              = (known after apply)
      + name            = "viewer-custom-realms"
      + realm_id        = "master"
    }

  # module.keycloak_test.module.master_viewer_role.data.keycloak_openid_client.clients["bcparks-service-transformation"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_openid_client" "clients"  {
      + access_token_lifespan                      = (known after apply)
      + access_type                                = (known after apply)
      + admin_url                                  = (known after apply)
      + authentication_flow_binding_overrides      = (known after apply)
      + authorization                              = (known after apply)
      + backchannel_logout_revoke_offline_sessions = (known after apply)
      + backchannel_logout_session_required        = (known after apply)
      + backchannel_logout_url                     = (known after apply)
      + base_url                                   = (known after apply)
      + client_authenticator_type                  = (known after apply)
      + client_id                                  = "bcparks-service-transformation-realm"
      + client_offline_session_idle_timeout        = (known after apply)
      + client_offline_session_max_lifespan        = (known after apply)
      + client_secret                              = (sensitive value)
      + client_session_idle_timeout                = (known after apply)
      + client_session_max_lifespan                = (known after apply)
      + consent_required                           = (known after apply)
      + description                                = (known after apply)
      + direct_access_grants_enabled               = (known after apply)
      + enabled                                    = (known after apply)
      + exclude_session_state_from_auth_response   = (known after apply)
      + extra_config                               = (known after apply)
      + frontchannel_logout_enabled                = (known after apply)
      + frontchannel_logout_url                    = (known after apply)
      + full_scope_allowed                         = (known after apply)
      + id                                         = (known after apply)
      + implicit_flow_enabled                      = (known after apply)
      + login_theme                                = (known after apply)
      + name                                       = (known after apply)
      + pkce_code_challenge_method                 = (known after apply)
      + realm_id                                   = "master"
      + resource_server_id                         = (known after apply)
      + root_url                                   = (known after apply)
      + service_account_user_id                    = (known after apply)
      + service_accounts_enabled                   = (known after apply)
      + standard_flow_enabled                      = (known after apply)
      + use_refresh_tokens                         = (known after apply)
      + use_refresh_tokens_client_credentials      = (known after apply)
      + valid_redirect_uris                        = (known after apply)
      + web_origins                                = (known after apply)
    }

  # module.keycloak_test.module.master_viewer_role.data.keycloak_role.view_authorization["bcparks-service-transformation"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "view_authorization"  {
      + attributes      = (known after apply)
      + client_id       = (known after apply)
      + composite_roles = (known after apply)
      + description     = (known after apply)
      + id              = (known after apply)
      + name            = "view-authorization"
      + realm_id        = "master"
    }

  # module.keycloak_test.module.master_viewer_role.data.keycloak_role.view_clients["bcparks-service-transformation"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "view_clients"  {
      + attributes      = (known after apply)
      + client_id       = (known after apply)
      + composite_roles = (known after apply)
      + description     = (known after apply)
      + id              = (known after apply)
      + name            = "view-clients"
      + realm_id        = "master"
    }

  # module.keycloak_test.module.master_viewer_role.data.keycloak_role.view_events["bcparks-service-transformation"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "view_events"  {
      + attributes      = (known after apply)
      + client_id       = (known after apply)
      + composite_roles = (known after apply)
      + description     = (known after apply)
      + id              = (known after apply)
      + name            = "view-events"
      + realm_id        = "master"
    }

  # module.keycloak_test.module.master_viewer_role.data.keycloak_role.view_identity_providers["bcparks-service-transformation"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "view_identity_providers"  {
      + attributes      = (known after apply)
      + client_id       = (known after apply)
      + composite_roles = (known after apply)
      + description     = (known after apply)
      + id              = (known after apply)
      + name            = "view-identity-providers"
      + realm_id        = "master"
    }

  # module.keycloak_test.module.master_viewer_role.data.keycloak_role.view_realm["bcparks-service-transformation"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "view_realm"  {
      + attributes      = (known after apply)
      + client_id       = (known after apply)
      + composite_roles = (known after apply)
      + description     = (known after apply)
      + id              = (known after apply)
      + name            = "view-realm"
      + realm_id        = "master"
    }

  # module.keycloak_test.module.master_viewer_role.data.keycloak_role.view_users["bcparks-service-transformation"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "view_users"  {
      + attributes      = (known after apply)
      + client_id       = (known after apply)
      + composite_roles = (known after apply)
      + description     = (known after apply)
      + id              = (known after apply)
      + name            = "view-users"
      + realm_id        = "master"
    }

  # module.keycloak_test.module.master_viewer_role.keycloak_openid_client.viewer_service_account will be created
  + resource "keycloak_openid_client" "viewer_service_account" {
      + access_type                               = "CONFIDENTIAL"
      + backchannel_logout_session_required       = true
      + client_authenticator_type                 = "client-secret"
      + client_id                                 = "viewer-custom-realms-cli"
      + client_secret                             = (sensitive value)
      + consent_required                          = false
      + direct_access_grants_enabled              = false
      + display_on_consent_screen                 = false
      + enabled                                   = true
      + exclude_session_state_from_auth_response  = false
      + frontchannel_logout_enabled               = false
      + full_scope_allowed                        = true
      + id                                        = (known after apply)
      + implicit_flow_enabled                     = false
      + name                                      = "viewer-custom-realms-cli"
      + oauth2_device_authorization_grant_enabled = false
      + realm_id                                  = "master"
      + resource_server_id                        = (known after apply)
      + service_account_user_id                   = (known after apply)
      + service_accounts_enabled                  = true
      + standard_flow_enabled                     = false
      + use_refresh_tokens                        = true
      + use_refresh_tokens_client_credentials     = false
    }

  # module.keycloak_test.module.master_viewer_role.keycloak_openid_client_service_account_realm_role.viewer_service_account_viewer_role will be created
  + resource "keycloak_openid_client_service_account_realm_role" "viewer_service_account_viewer_role" {
      + id                      = (known after apply)
      + realm_id                = "master"
      + role                    = "viewer-custom-realms"
      + service_account_user_id = (known after apply)
    }

  # module.keycloak_test.module.master_viewer_role.keycloak_role.viewer will be created
  + resource "keycloak_role" "viewer" {
      + composite_roles = (known after apply)
      + id              = (known after apply)
      + name            = "viewer-custom-realms"
      + realm_id        = "master"
    }

  # module.keycloak_prod.module.custom_realms.module.bcparks-service-transformation.module.realm_admin.module.realm_admin.keycloak_group.group will be created
  + resource "keycloak_group" "group" {
      + id       = (known after apply)
      + name     = "Realm Administrator"
      + path     = (known after apply)
      + realm_id = "bcparks-service-transformation"
    }

  # module.keycloak_prod.module.custom_realms.module.bcparks-service-transformation.module.realm_admin.module.realm_admin.keycloak_group_roles.role_group_binding will be created
  + resource "keycloak_group_roles" "role_group_binding" {
      + exhaustive = true
      + group_id   = (known after apply)
      + id         = (known after apply)
      + realm_id   = "bcparks-service-transformation"
      + role_ids   = [
          + "2eee1419-877d-4640-9246-2f3b7c40a790",
        ]
    }

  # module.keycloak_prod.module.custom_realms.module.bcparks-service-transformation.module.realm_viewer.module.realm_viewer.keycloak_group.group will be created
  + resource "keycloak_group" "group" {
      + id       = (known after apply)
      + name     = "Realm Viewer"
      + path     = (known after apply)
      + realm_id = "bcparks-service-transformation"
    }

  # module.keycloak_prod.module.custom_realms.module.bcparks-service-transformation.module.realm_viewer.module.realm_viewer.keycloak_group_roles.role_group_binding will be created
  + resource "keycloak_group_roles" "role_group_binding" {
      + exhaustive = true
      + group_id   = (known after apply)
      + id         = (known after apply)
      + realm_id   = "bcparks-service-transformation"
      + role_ids   = [
          + "bf405a0f-cd3e-4590-9a1e-4fa98b94ae2a",
        ]
    }

  # module.keycloak_test.module.custom_realms.module.bcparks-service-transformation.module.realm_viewer.module.realm_viewer.keycloak_group.group will be created
  + resource "keycloak_group" "group" {
      + id       = (known after apply)
      + name     = "Realm Viewer"
      + path     = (known after apply)
      + realm_id = "bcparks-service-transformation"
    }

  # module.keycloak_test.module.custom_realms.module.bcparks-service-transformation.module.realm_viewer.module.realm_viewer.keycloak_group_roles.role_group_binding will be created
  + resource "keycloak_group_roles" "role_group_binding" {
      + exhaustive = true
      + group_id   = (known after apply)
      + id         = (known after apply)
      + realm_id   = "bcparks-service-transformation"
      + role_ids   = [
          + "81be272f-96a6-432b-9ec3-a1c48fc74e6f",
        ]
    }

Plan: 15 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
Releasing state lock. This may take a few moments...
```

</details>

*Pusher: @junminahn, Action: `pull_request`*